<?php
    //* Завдання 1
    // ----------------------------------------------------------------
    // Виводимо повідомлення на сторінку
    echo "Hello, World!<br><br>"; 
    // ----------------------------------------------------------------
    


    //* Завдання 2
    // ----------------------------------------------------------------
    // Оголошуємо та ініціалізуємо змінні різних типів
    $name = "Ivan";     // string
    $age = 25;          // int
    $height = 183.1;    // float
    $adult = true;      // boolean
    
    // Виводимо значення та тип змінних на сторінку
    echo "Name: {$name} | "; var_dump($name);
    echo "<br>Age: {$age} | "; var_dump($age);
    echo "<br>Height: {$height} | "; var_dump($height);
    echo "<br>Adult?: {$adult} | "; var_dump($adult);
    // ----------------------------------------------------------------
    


    //* Завдання 3
    // ----------------------------------------------------------------
    $surname = "Ivanov";
    $userNS = $name . " " . $surname;  // Конкатенація рядків
    echo "<br><br>" . $userNS;
    // ----------------------------------------------------------------
    


    //* Завдання 4
    // ----------------------------------------------------------------
    $a = 52;

    // Перевіряємо число $a на парність
    echo "<br><br>Число {$a} - ";
    if ($a % 2 == 0) {
        echo "парне";
    } else {
        echo "непарне";
    }
    // ----------------------------------------------------------------
    
    
    
    //* Завдання 5
    // ----------------------------------------------------------------
    echo"<br><br>For: ";
    // Виведення від 1 до 10
    for ($i=1; $i <= 10; $i++) { 
        echo $i . " ";
    }
    
    echo"<br>While: ";
    // Виведення від 10 до 1
    $iter = 10;
    while($iter > 0) {
        echo $iter . " ";
        $iter--;
    }
    // ----------------------------------------------------------------
    
    
    
    //* Завдання 6
    // ----------------------------------------------------------------
    // Створюємо масив
    $student = [
        "name" => "Kolya",
        "surname" => "Fedorov",
        "age" => 18,
        "specialty" => "CyberSecurity"
    ];
    
    echo"<br><br>До змін:<br>";
    // Виведення кожного елемента масиву
    foreach($student as $key => $value) {
        echo "$key: $value <br>";
    }
    
    $student["avg_score"] = 93.5;   // Додаємо новий елемент.

    echo "<br>Після змін:<br>";
    foreach($student as $key => $value) {
        echo "$key: $value <br>";
    }
    // ----------------------------------------------------------------

?>